'''
1. Hello World! (출력)
"Hello World!" 를 출력하세요
print()

'''


'''
2. 사칙연산은 즐거워 (입력, 출력, 계산)
사용자한테 숫자 2개를 입력받으세요.
두 숫자의 더하기, 빼기, 곱하기, 더하기 결과를 출력하세요
input() print()
'''

'''
3. 내 평균은 몇등급?!(입력, 출력, 계산)
사용자한테 국어, 영어, 수학 점수를 입력받으세요.
사용자의 평균 점수를 avg라는 변수에 저장하세요.
평균 점수가 91~ 100 이면 A
평균 점수가 81~ 90 이면 B
평균 점수가 71~ 80 이면 C
평균 점수가 61~ 70 이면 D
평균 점수가 0~ 60 이면 F
를 출력하세요
'''


'''
4. 강조되고 반복되는 소리는 강아지를 힘들게해요 1(반복, 입력, 출력)
사용자한테 숫자 하나를 입력 받아 변수에 저장하세요.
1부터 사용자가 입력한 숫자까지 한 줄에 하나씩 출력해주세요
주의 ) 0부터가 아니라 1부터 출력해야해요
'''

'''
5. 강조되고 반복되는 소리는 강아지를 힘들게해요 2(반복, 입력, 출력)
4번 문제에서 3의 배수만 출력되게 바꿔주세요.
'''

'''
6. 여행 갈 때 뭐가지고 가지? (반복, 리스트)
사용자한테 여행 갈 때 가져갈 물건이 몇개인지 물어봐서 변수에 저장해요
사용자가 입력한 물건의 갯수만큼 반복해요
반복하면서 가져갈 물건이 무엇인지 입력받고,
checkList라는 리스트에 하나씩 추가해주세요.
'''

'''
7. 구구단은 분명히 초등학생 때 끝났는데...? (반복, 2중 반복)
1단부터 9단까지 모두 출력해주는 프로그램을 작성하세요
2중 for문 (for문 안에 for문)을 사용해주세요
'''

'''
8. 보너스
lists = []
lists.append("홍길동")
lists.append("53")
lists.append("고양이")

print(______,"님의 나이는",______,"살이고",______,"를 좋아합니다")
빈칸을 채워주세요

'''

'''
9. (도전) 상근이와 설탕공장
상근이는 요즘 설탕공장에서 설탕을 배달하고 있다.
상근이는 지금 사탕가게에 설탕을 정확하게 N킬로그램을 배달해야 한다.
설탕공장에서 만드는 설탕은 봉지에 담겨져 있다.
봉지는 3킬로그램 봉지와 5킬로그램 봉지가 있다.
상근이는 귀찮기 때문에, 최대한 적은 봉지를 들고 가려고 한다.
예를 들어, 18킬로그램 설탕을 배달해야 할 때, 3킬로그램 봉지 6개를 가져가도 되지만,
5킬로그램 3개와 3킬로그램 1개를 배달하면, 더 적은 개수의 봉지를 배달할 수 있다.
상근이가 설탕을 정확하게 N킬로그램 배달해야 할 때,
봉지 몇 개를 가져가면 되는지 그 수를 구하는 프로그램을 작성하시오.

입력 -> 설탕 무게인 N이 입력됩니다.
N = int(input())

출력 -> 상근이가 배달하는 봉지의 최소 개수를 출력한다.
만약, 정확하게 N킬로그램을 만들 수 없다면 -1을 출력한다.

예시
N - > 18
출력 -> 4

N - > 4
출력 -> -1

N - > 6
출력 -> 2

N - > 9
출력 -> 3
'''

'''
10. (도전) 달팽이는 죽지 않아요 댓가를 치를 뿐.
땅 위에 달팽이가 있다. 이 달팽이는 높이가 V미터인 나무 막대를 올라갈 것이다.

달팽이는 낮에 A미터 올라갈 수 있다. 하지만, 밤에 잠을 자는 동안 B미터 미끄러진다.
또, 정상에 올라간 후에는 미끄러지지 않는다.

달팽이가 나무 막대를 모두 올라가려면, 며칠이 걸리는지 구하는 프로그램을 작성하시오.

입력 -> 첫째 줄에 세 정수 A, B, V가 공백으로 구분되어서 주어진다. (split 사용)
출력 -> 첫째 줄에 달팽이가 나무 막대를 모두 올라가는데 며칠이 걸리는지 출력한다.

예시 입력 -> 2 1 5
예시 출력 -> 4

예시 입력 -> 5 1 6
예시 출력 -> 2

예시 입력 -> 100 99 1000000000
예시 출력 -> 999999901
'''







